# RibbonItemData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RibbonItemData Members
RibbonItemData Class Methods Properties See Also
---
The RibbonItemData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetContextualHelp | Gets the contextual help bound with this control. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetContextualHelp | Sets the contextual help bound with this button data. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LongDescription | Long description of the command tooltip |
| Name | The name of the item. |
| ToolTip | The description that appears as a ToolTip for the item. |
| ToolTipImage | The image to show as a part of the button extended tooltip |

# See Also
RibbonItemData Class
Autodesk.Revit.UI Namespace